# Introduction to Pandas

---

Pandas is a high-level data manipulation package which was built on top of Numpy. The key structures within pandas include Series and DataFrames.

## Series

A Series is a one-dimensional array with axis labels (an index).

In [1]:
# Importing libraries and packages
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
# We can access different components separately:

# Accessing the index
x.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
# And the values:
x.values

array([10, 20, 30, 40, 50])

A series is an ndarray, thus it is homogenous and CANNOT store multiple data types

In [6]:
# Creating a Series with an Index
data = [450, 650, 870]
Sales = Series(data, index=['Don', 'Mike', 'Edwin'])
Sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [9]:
# Check the type
type(Sales)

pandas.core.series.Series

In [10]:
# If we check the index of Sales, we will get the values, rather than the range, as we have changed them to strings
Sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

### Accessing Values

In [11]:
# You can access values using the index name
Sales["Don"]

np.int64(450)

### Checking for Conditions

In [7]:
# You can filter based on conditions
Sales>500
# This will usually return booleans

Don      False
Mike      True
Edwin     True
dtype: bool

In [8]:
# We can use these booleans
Sales[[False, True, True]]

Mike     650
Edwin    870
dtype: int64

In [9]:
Sales[Sales>500]

Mike     650
Edwin    870
dtype: int64

In [19]:
# Checking the name in the index
"Don" in Sales

True

In [10]:
# False example
"Howard" in Sales

False

In [21]:
450 in Sales
# 450 is not an index, it's a value. Thus it will return False

False

### Working with Dictionaries

In [23]:
# Converting a Series to a dictionary
sales_dict = Sales.to_dict()
sales_dict

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [27]:
# Converting a dict to a Series
sales_ser = Series(sales_dict)
sales_ser

Don      450
Mike     650
Edwin    870
dtype: int64

### Adding entries and working with NaN/null values

In [11]:
# We can create a new Series from an existing Series
# If we specify names in the index that were NOT there already, NaN values will be assigned
new_sales = Series(Sales, index=["Don", "Mike", "Sally", "Edwin", "Lucy"])
new_sales

Don      450.0
Mike     650.0
Sally      NaN
Edwin    870.0
Lucy       NaN
dtype: float64

In [12]:
np.isnan(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [30]:
# To check for null values, use Pandas!
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [36]:
Sales.index.name = 'Sales person'
Sales

Sales person
Don      450
Mike     650
Edwin    870
Name: Total tv sales, dtype: int64

In [34]:
Sales.name = 'Total tv sales'
Sales

Don      450
Mike     650
Edwin    870
Name: Total tv sales, dtype: int64

## DataFrames
DataFrames are two-dimensional, size-mutable, potentially heterogeneous tabular data structures. This data structure contains TWO labeled axes (rows and columns).

### Creating a DataFrame

In [13]:
# Creating a DataFrame from a list
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]

# When we create a DataFrame, we can specify what the column names are and the data type is
df = pd.DataFrame(data, columns=["Name", "Age"])
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

### Creating a DataFrame from a Dictionary

In [8]:
# Use the from_dict method - the keys will become the column titles
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
df = pd.DataFrame.from_dict(data)
df

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

### Creating a DataFrame from a List of Dictionaries

Pandas likes having lists of dicts - providing the key names are the same, it will automatically convert them to a DataFrame.

In [9]:
data = [
    {'name': 'Alice', 'age': 25, 'city': 'London'},
    {'name': 'Bob', 'age': 30, 'city': 'Paris'},
    {'name': 'Charlie', 'age': 35, 'city': 'Berlin'}
]
df = pd.DataFrame(data)
df

      name  age    city
0    Alice   25  London
1      Bob   30   Paris
2  Charlie   35  Berlin

### Creating a DataFrame from a Series

You can pass a Series to the DataFrame constructor itself!

In [12]:
series = pd.Series([1, 2, 3], index=['a', 'b', 'c'])

# Convert Series to DataFrame
df = pd.DataFrame(series, columns=['Values'])
df

   Values
a       1
b       2
c       3

### Adding a Series to an existing DF

This can be done easily, similarly to adding entries to a Python dict

In [14]:
# Sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})
# Sample Series
s = pd.Series([7, 8, 9])
# Adding a new column to the DataFrame with our data as the values
df['C'] = s
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

### Shifting/Changing a DataFrame's index

We can call the set_index method on a DataFrame to turn one of the columns into the index (row labels)

In [16]:
# Create a sample DataFrame
df = pd.DataFrame({
'month': [1, 4, 7, 10],
'year': [2012, 2014, 2013, 2014],
'sale': [55, 40, 84, 31]
})

# Set the index to become the 'month' column
df.set_index('month', inplace=True)
df

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

### How to fill missing values

Pandas has the `.fillna(value)` method to fill in empty values with a particular value

In [17]:
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 2, 3, 4]
})

# Find values that are missing and replace them with 0
df_filled = df.fillna(0)
df_filled

     A    B
0  1.0  0.0
1  2.0  2.0
2  0.0  3.0
3  4.0  4.0

### What if we don't want to fill every value with the same data?

`backfill`:

In [ ]:
# (this command is deprecated)

`bfill`:
The updated version of backfill - this method fills NaN values with the next valid observation.

In [19]:
data = {
    'A': [1, np.nan, 3, np.nan, 5],
    'B': [np.nan, 2, np.nan, np.nan, 4]
}
df = pd.DataFrame(data)
df.bfill()
# Finds the next option and fills in the gaps

     A    B
0  1.0  2.0
1  3.0  2.0
2  3.0  4.0
3  5.0  4.0
4  5.0  4.0

`pad`:

In [ ]:
# (this command is also deprecated)

`ffill`:
The same as bfill, but takes the most recent value.

In [20]:
data = {
    'A': [1, np.nan, 3, np.nan, 5],
    'B': [np.nan, 2, np.nan, np.nan, 4]
}
df = pd.DataFrame(data)
df.ffill()

     A    B
0  1.0  NaN
1  1.0  2.0
2  3.0  2.0
3  3.0  2.0
4  5.0  4.0

### What does .interpolate() do?

This is another method to deal with missing values - the `.interpolate()` method fills in values using various different interpolation techniques. The default is linear interpolation, but by changing the `(method=*)` argument you can use others, including `time`, `index`, and various Scipy functions like `quadratic`.

In [21]:
df = pd.DataFrame({
'A': [1, 2, np.nan, 4],
'B': [5, np.nan, np.nan, 8],
'C': [9, 10, 11, 12]
})

# Interpolate missing values
df_interpolated = df.interpolate()
df_interpolated
# As can be seen, the values will be replaced with evenly spaced alternatives.

     A    B   C
0  1.0  5.0   9
1  2.0  6.0  10
2  3.0  7.0  11
3  4.0  8.0  12

## How to drop values

### Drop rows or columns

Rows or columns can be dropped in various ways. Columns can easily be dropped using the `.drop(colname, axis=1)` method:

In [23]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8]
})

# Drop column 'B'
df = df.drop('B', axis=1)
print(df)

   A
0  1
1  2
2  3
3  4

### Drop based on a threshold

We might want to drop rows based on a threshold, such as if a condition is met or there are missing values:

In [30]:
df = pd.DataFrame({
    'A': [1, 2, 3, 0],
    'B': [5, 6, 7, np.nan]
})

# Drop rows where column 'A' is greater than 2
df = df[df['A'] <= 2]
print(df)

# And we can also drop rows with NaNs:
df = df.dropna()
df

   A    B
0  1  5.0
1  2  6.0
3  0  NaN

   A    B
0  1  5.0
1  2  6.0

### Drop based on an index

We can also drop rows by index by not passing an `axis` argument in `drop()`:

In [34]:
df = pd.DataFrame({
    'A': [1, 2, 3, 0],
    'B': [5, 6, 7, np.nan]
})

df.drop([1,3])
# This drops the columns with indices 1 and 3 - all normal Python 
# indexing operations such as slicing can also be used

   A    B
0  1  5.0
2  3  7.0

### Remove duplicate rows

Duplicate rows can be removed using the `drop_duplicates()` method:

In [35]:
df = pd.DataFrame({
'team': ['a', 'b', 'b', 'c', 'c', 'd'],
'points': [3, 7, 7, 8, 8, 9],
'assists': [8, 6, 7, 9, 9, 3]
})
# As you can see, there will be two rows in this DataFrame that read "c, 8, 9"

df_cleaned = df.drop_duplicates()
df_cleaned

  team  points  assists
0    a       3        8
1    b       7        6
2    b       7        7
3    c       8        9
5    d       9        3

### Find duplicate rows

We can get a Boolean Series indicating whether each row is duplicated or not using `.duplicated()`:

In [39]:
data = {
    'A': [1, 2, 2, 4, 5, 2],
    'B': ['a', 'b', 'b', 'd', 'e', 'b']
}
df = pd.DataFrame(data)

df.duplicated()
# Bear in mind - it doesn't tell us which row the dupes have duplicated from, just that 
# prior to that there is a duplicate. This is however useful for removing duplicated rows
# from data.

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

### How to select an entire column

In [40]:
# This is easy - you can refer to it by name like a dict key:
data = {
    'A': [1, 2, 2, 4, 5, 2],
    'B': ['a', 'b', 'b', 'd', 'e', 'b']
}
df = pd.DataFrame(data)

data['B']

['a', 'b', 'b', 'd', 'e', 'b']

### iloc and loc

`iloc` and `loc` are ways of selecting certain data from a DataFrame. `iloc` is short for index-based location, and as the name would imply is used for finding data based on numerical index.

In [42]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
df = pd.DataFrame(data)

# Accessing the first row
df.iloc[0]

Name    Alice
Age        25
Name: 0, dtype: object

`loc` by contrast can be used for more semantic, text-based location if you have a DataFrame with meaningful column and row titles.

In [44]:
data = [[50, True], [40, False], [30, False]]
label_rows = ["Sally", "Mary", "John"]
label_cols = ["age", "qualified"]
# Data that has meaning

df = pd.DataFrame(data, label_rows, label_cols)
df.loc["Mary", "age"] # This will give us Mary's age

np.int64(40)

### Filtering to select specific info

You can put various kinds of logic in the square brackets to filter a DataFrame.

In [17]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [24, 27, 22, 32],
    'city': ['London', 'Paris', 'Berlin', 'Madrid']
}

df = pd.DataFrame(data)
df.loc[df['age']>25]

    name  age    city
1    Bob   27   Paris
3  David   32  Madrid

In [19]:
df[df['name'] != 'Charlie']

    name  age    city
0  Alice   24  London
1    Bob   27   Paris
3  David   32  Madrid

### Sort

Using the `sort_values(by=<string or list of strings>)` method is an easy way to sort your DataFrame. Input the column titles by which you want the data to be sorted.

In [48]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [24, 19, 22]}
df = pd.DataFrame(data)

# Sort by 'Age'
df.sort_values(by='Age')

      Name  Age
1      Bob   19
2  Charlie   22
0    Alice   24

In [50]:
# Easily change it back like so:
df.sort_index()

      Name  Age
0    Alice   24
1      Bob   19
2  Charlie   22

### Rank

Using the `rank()` method will generate a ranking for each row of the DataFrame based on a selected column. The `method=` argument resolves ties in various ways.

In [58]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Edna'],
    'Score': [85, 92, 78, 88, 88]
}

df = pd.DataFrame(data)

df['Score'].rank(method='max')

0    2.0
1    5.0
2    1.0
3    4.0
4    4.0
Name: Score, dtype: float64

### describe()

A very useful command that generates some descriptive statistics about the data in a DataFrame.

In [60]:
data = {
'A': [1, 2, 3, 4, 5],
'B': [5, 4, 3, 2, 1],
'C': ['a', 'b', 'c', 'd', 'e']
}

df = pd.DataFrame(data)
df.describe()

              A         B
count  5.000000  5.000000
mean   3.000000  3.000000
std    1.581139  1.581139
min    1.000000  1.000000
25%    2.000000  2.000000
50%    3.000000  3.000000
75%    4.000000  4.000000
max    5.000000  5.000000

### Summary statistics

You can use Numpy's statistical methods on Pandas dataframes, and you can even break them down column-by-column.

In [64]:
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [5, 4, 3, 2, 1],
    'C': [2, 3, 4, 5, 6]
}
df = pd.DataFrame(data)

df['A'].mean()

np.float64(3.0)

In [65]:
df[['A', 'C']].var() # Shows the variance of A and C

A    2.5
C    2.5
dtype: float64

The introductory tutorials on the pandas documentation site are a great way to learn more: [summary statistics](https://pandas.pydata.org/docs/getting_started/intro_tutorials/06_calculate_statistics.html)

Examples of interesting things you can do include using `.groupby('colname')` to group the output by the variables in that column

### Index Hierarchy

You can give a DataFrame more than one index by using **index hierarchy**. This will group shared indices together, creating nested categories within the table. An example:

In [20]:
# Creating a MultiIndex DataFrame
arrays = [
    ['California', 'California', 'New York', 'New York'],
    ['San Francisco', 'Los Angeles', 'Buffalo', 'New York City']
]
index = pd.MultiIndex.from_arrays(arrays, names=['State', 'City'])
df = pd.DataFrame({'Population': [884363, 3898747, 278349, 8804190]}, index=index)
# Using a MultiIndex object as the index to make it work 

df

                          Population
State      City
California San Francisco      884363
           Los Angeles       3898747
New York   Buffalo            278349
           New York City     8804190

As you can see, the indices become nested, so that we can consider each "City" as belonging to a "State", and then "Population" (and potentially other values) as belonging to each City. This can enable us to do detailed statistical analysis:

In [22]:
# Get mean population by state
df.groupby(level='State').mean()

            Population
State
California   2391555.0
New York     4541269.5

In [72]:
df.groupby(level='City').mean() # though of course each city only has one value

               Population
City
Buffalo          278349.0
Los Angeles     3898747.0
New York City   8804190.0
San Francisco    884363.0